In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [21]:
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Aammar', 'Amaar', 'Hamza', 'Hazma'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}
# make pandas dataframe
df = pd.DataFrame(data)

In [22]:
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1  01-12-2022         U.S.A.   Amaar       200.0       150.0
2  2022/12/01        America   Hamza         NaN       300.0
3  12-01-2021  United States   Hazma       200.0       150.0

In [23]:
df['date'] = pd.to_datetime(df['date'], errors='coerce')

df['date']  = pd.to_datetime(df['date'].dt.strftime('%Y-%m-%d'))

In [24]:
df.head()

        date        country    name  sales_2020  sales_2021
0 2021-12-01            USA  Aammar       100.0         NaN
1 2022-01-12         U.S.A.   Amaar       200.0       150.0
2 2022-12-01        America   Hamza         NaN       300.0
3 2021-12-01  United States   Hazma       200.0       150.0

In [25]:
country_mapping = {'USA':'United States', 'U.S.A.':'United States', 'America':'United States', 'United States':'United States'}
df['country']= df['country'].replace(country_mapping)

In [26]:
df.head()

        date        country    name  sales_2020  sales_2021
0 2021-12-01  United States  Aammar       100.0         NaN
1 2022-01-12  United States   Amaar       200.0       150.0
2 2022-12-01  United States   Hamza         NaN       300.0
3 2021-12-01  United States   Hazma       200.0       150.0

In [27]:
# Harmonize the name of the coutry
df['country'] = df['country'].replace({'USA': 'United States', 'U.S.A.': 'United States', 'America': 'United States'})
df.head()

        date        country    name  sales_2020  sales_2021
0 2021-12-01  United States  Aammar       100.0         NaN
1 2022-01-12  United States   Amaar       200.0       150.0
2 2022-12-01  United States   Hamza         NaN       300.0
3 2021-12-01  United States   Hazma       200.0       150.0

In [30]:
df['name']=df['name'].replace({'Ammar':'Aammar', 'Amaar':'Aammar', 'Hamza':'Hamza','Hazma':'Hamza'})

In [31]:
df.head()

        date        country    name  sales_2020  sales_2021
0 2021-12-01  United States  Aammar       100.0         NaN
1 2022-01-12  United States  Aammar       200.0       150.0
2 2022-12-01  United States   Hamza         NaN       300.0
3 2021-12-01  United States   Hamza       200.0       150.0

In [32]:
df.drop_duplicates('name')

        date        country    name  sales_2020  sales_2021
0 2021-12-01  United States  Aammar       100.0         NaN
2 2022-12-01  United States   Hamza         NaN       300.0

In [ ]:
S